# BuiltInFailures.CopyMonitorFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyMonitorFailures Class
BuiltInFailures Class Members See Also
---
Failures about CopyWatch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CopyMonitorFailures
```

Visual Basic
---
```text
Public NotInheritable Class CopyMonitorFailures
```

Visual C++
---
```text
public ref class CopyMonitorFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CopyMonitorFailures
# See Also
BuiltInFailures..::..CopyMonitorFailures Members
Autodesk.Revit.DB Namespace